In [33]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\oskar.laptop-karlnf81\appdata\local\programs\python\python312\lib\site-packages (8.4.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 24.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [34]:
import mysql.connector
import pandas as pd
from sqlalchemy import create_engine

In [35]:

con = mysql.connector.connect(
    host = "giniewicz.it",
    user = "team07",
    password = "te@m24ot",
    database = "team07",
)

if(con):
    print("Połączenie udane")
else:
    print("Połączenie udane")

con.close()

Połączenie udane

In [36]:
input = """
        
CREATE TABLE klienci
(
  id                  INT           NOT NULL,
  imię                VARCHAR(255)  NULL    ,
  nazwisko            VARCHAR(255)  NULL    ,
  płeć                ENUM('K','M') NULL     DEFAULT NULL,
  PESEL               CHAR(11)      NULL    ,
  miasto              VARCHAR(255)  NULL    ,
  adres               VARCHAR(255)  NULL    ,
  karta_lojalnościowa BIT           NULL     DEFAULT 0 COMMENT '1 = posiada, 0 = nie posiada',
  telefon             VARCHAR(20)   NULL    ,
  email               VARCHAR(255)  NULL    ,
  PRIMARY KEY (id)
);

CREATE TABLE pracownicy
(
  id                INT          NOT NULL,
  imię              VARCHAR(255) NOT NULL,
  nazwisko          VARCHAR(255) NOT NULL,
  PESEL             CHAR(11)     NOT NULL,
  miasto            VARCHAR(255) NOT NULL,
  adres             VARCHAR(255) NOT NULL,
  telefon           VARCHAR(20)  NOT NULL,
  email             VARCHAR(255) NOT NULL,
  data_zatrudnienia DATE         NOT NULL,
  data_zwolnienia   DATE         NULL    ,
  stanowisko        VARCHAR(69)  NOT NULL COMMENT 'da się długośc jak ustalimy stanowiska',
  płaca             DECIMAL(5,2) NOT NULL COMMENT 'zł/h',
  PRIMARY KEY (id)
);

CREATE TABLE samochody
(
  id                INT                                                NOT NULL,
  marka             VARCHAR(25)                                        NOT NULL,
  model             VARCHAR(30)                                        NOT NULL,
  liczba_kół        ENUM('2','4')                                      NOT NULL,
  rok_produkcji     YEAR(4)                                            NOT NULL,
  typ_nadwozia      VARCHAR(25)                                        NULL    ,
  czy_powypadkowy   BIT                                                NOT NULL DEFAULT 0,
  kolor             VARCHAR(25)                                        NOT NULL,
  typ_paliwa        VARCHAR(25)                                        NULL    ,
  pojemność_silnika DECIMAL(3,1)                                       NULL    ,
  moc               INT                                                NULL    ,
  skrzynia_biegów   ENUM('Automatyczna', 'Manualna','Półautomatyczna') NOT NULL,
  liczba_drzwi      ENUM('0','3','5')                                  NOT NULL,
  liczba_miejsc     ENUM('1','2','5','7')                              NOT NULL,
  czy_dostępny      BIT                                                NOT NULL DEFAULT 0,
  PRIMARY KEY (id)
);

CREATE TABLE sprzedaż_samochodu
(
  id                 INT                 NOT NULL,
  id_samochodu       INT                 NOT NULL,
  id_klienta         INT                 NOT NULL,
  id_pracownika      INT                 NOT NULL,
  cena               DECIMAL(12,2)       NOT NULL,
  liczba_rat         TINYINT(2) UNSIGNED NOT NULL DEFAULT 1,
  data_zaksięgowania DATE                NOT NULL,
  PRIMARY KEY (id)
);

CREATE TABLE usługi
(
  id                 INT           NOT NULL,
  id_samochodu       INT           NOT NULL,
  id_klienta         INT           NOT NULL,
  id_pracownika      INT           NOT NULL,
  cena               DECIMAL(12,2) NOT NULL,
  data_zaksięgowania DATE          NOT NULL,
  PRIMARY KEY (id)
);

CREATE TABLE użyte_części
(
  id        INT            NOT NULL,
  id_usługi INT            NOT NULL,
  id_części INT            NOT NULL,
  ilość     INT            NOT NULL DEFAULT 1,
  cena      DECIMAL(12, 2) NOT NULL,
  PRIMARY KEY (id)
);

CREATE TABLE wyposażenie
(
  id      INT         NOT NULL,
  nazwa   VARCHAR(69) NOT NULL COMMENT 'da się długośc jak ustalimy typy rzeczy',
  atrybut VARCHAR(50) NULL    ,
  PRIMARY KEY (id)
);

CREATE TABLE zakup_samochodu
(
  id                 INT           NOT NULL,
  id_samochodu       INT           NOT NULL,
  id_klienta         INT           NOT NULL,
  id_pracownika      INT           NOT NULL,
  cena               DECIMAL(12,2) NOT NULL,
  data_zaksięgowania DATE          NOT NULL,
  PRIMARY KEY (id)
);

ALTER TABLE użyte_części
  ADD CONSTRAINT FK_usługi_TO_użyte_części
    FOREIGN KEY (id_usługi)
    REFERENCES usługi (id);

ALTER TABLE użyte_części
  ADD CONSTRAINT FK_wyposażenie_TO_użyte_części
    FOREIGN KEY (id_części)
    REFERENCES wyposażenie (id);

ALTER TABLE usługi
  ADD CONSTRAINT FK_samochody_TO_usługi
    FOREIGN KEY (id_samochodu)
    REFERENCES samochody (id);

ALTER TABLE zakup_samochodu
  ADD CONSTRAINT FK_samochody_TO_zakup_samochodu
    FOREIGN KEY (id_samochodu)
    REFERENCES samochody (id);

ALTER TABLE sprzedaż_samochodu
  ADD CONSTRAINT FK_samochody_TO_sprzedaż_samochodu
    FOREIGN KEY (id_samochodu)
    REFERENCES samochody (id);

ALTER TABLE zakup_samochodu
  ADD CONSTRAINT FK_pracownicy_TO_zakup_samochodu
    FOREIGN KEY (id_pracownika)
    REFERENCES pracownicy (id);

ALTER TABLE sprzedaż_samochodu
  ADD CONSTRAINT FK_klienci_TO_sprzedaż_samochodu
    FOREIGN KEY (id_klienta)
    REFERENCES klienci (id);

ALTER TABLE usługi
  ADD CONSTRAINT FK_klienci_TO_usługi
    FOREIGN KEY (id_klienta)
    REFERENCES klienci (id);

ALTER TABLE sprzedaż_samochodu
  ADD CONSTRAINT FK_pracownicy_TO_sprzedaż_samochodu
    FOREIGN KEY (id_pracownika)
    REFERENCES pracownicy (id);

ALTER TABLE usługi
  ADD CONSTRAINT FK_pracownicy_TO_usługi
    FOREIGN KEY (id_pracownika)
    REFERENCES pracownicy (id);

ALTER TABLE zakup_samochodu
  ADD CONSTRAINT FK_klienci_TO_zakup_samochodu
    FOREIGN KEY (id_klienta)
    REFERENCES klienci (id);

        
      """


input = input.replace("CREATE", "CREATE OR REPLACE")

inputs = input.split(";")
names = []
i = 0
while True:
    if "ALTER" in inputs[i]:
        break
    begin = inputs[i].find("REPLACE TABLE ") + len("REPLACE TABLE ")
    end = inputs[i][begin:].find("\n")
    names.append(inputs[i][begin:begin+end])
    i += 1

In [37]:
names

['klienci',
 'pracownicy',
 'samochody',
 'sprzedaż_samochodu',
 'usługi',
 'użyte_części',
 'wyposażenie',
 'zakup_samochodu']

In [38]:
dfs = []
for i in range(len(names)):
    df = pd.read_csv(f"outputs/{names[i]}.csv", index_col=0, dtype={"PESEL" : str, "liczba_kół": str, "liczba_drzwi": str, "liczba_miejsc": str})
    dfs.append(df)

In [39]:
dfs[0]

,imię,nazwisko,płeć,PESEL,miasto,adres,karta_lojalnościowa,telefon,email
id,,,,,,,,,
0,Klaudia,Kabelis,K,65062102620,Wrocław,ul. Kolejowa 10/28,False,48925887344,klaudia.kabelis@kuba.pl
1,Mykola,Wlizło,M,70031058190,Wrocław,ul. Lwowska 86/35,True,48829038265,h7w38b59rju77l2o6@gmail.com
2,Teresa,Kocot,K,77092009510,Wrocław,ul. Otolanka 41/51,False,48697524943,kocot772@yahoo.com
3,Szymon,Fardulekas,M,89021860314,Brzeg,ul. św. Jana 49/23,False,48991330591,s-fardulekas@onet.pl
4,Adam,Pielka,M,91101880130,Wrocław,ul. Jana Lechonia 82/35,False,48198097912,ol0v3038lq808x@gmail.com
...,...,...,...,...,...,...,...,...,...
1365,Dawid,Lisiewicz,M,80040521534,Wrocław,ul. Szmaragdowa 87,False,48270249119,lisiewicz1@interia.pl
1366,Mirosław,Kaus,M,74122165899,Konin,ul. Wzgórz Trzebnickich 5/51,False,48573817626,m_kaus74@gmail.com
1367,Adam,Krasnodębski,M,77022392736,Wrocław,ul. Zyndrama z Maszkowic 91/38,False,48653184906,ada_krasno9560@o2.pl
1368,Ewelina,Szmurło,K,68062620996,Wrocław,ul. Kazimierza Wierzyńskiego 51/50,False,48184228385,szmurlo689@gmail.com
1369,Rafał,Smyk,M,93121088695,Sanok,ul. Bazaltowa 90/24,False,48443612061,smyk931@wp.pl

In [40]:
con = mysql.connector.connect(
    host = "giniewicz.it",
    user = "team07",
    password = "te@m24ot",
    database = "team07",
)

engine = create_engine('mysql+mysqlconnector://team07:te%40m24ot@giniewicz.it:3306/team07', echo=False)

mycursor = con.cursor()

# klucze obce w innych tabelach związane z tą tabelą
mycursor.execute("SET FOREIGN_KEY_CHECKS = 0")

for i in range(len(dfs)): # Stworzenie tabel bez zależności
    mycursor.execute(inputs[i])
    con.commit()

mycursor.execute("SET FOREIGN_KEY_CHECKS = 1")

for i in range(len(dfs)): # Wypełnienie tabel
    print(names[i])
    dfs[i].to_sql(con=engine, name=names[i], if_exists="append")

for i in range(len(dfs), len(inputs)-1): # Dodanie zależności (kluczów obcych) w tabelach
    mycursor.execute(inputs[i])
    con.commit()


mycursor.close()
con.close()

klienci
pracownicy
samochody
sprzedaż_samochodu
usługi
użyte_części
wyposażenie
zakup_samochodu